/**
 * CGo OpenMap - 三亚 线路数据库 (city/sanya/data_lines.js)
 */

const LINE_META = {
    "SY-T1": { svg: "icon@01.svg", company: "三亚轨道交通" },
    "SY-SL": { svg: "icon@56.svg", svgclr: "#29ABE2", svgtext: "#ffffff", company: "中国铁路广州局" },
};

const linesData = [
    {
        id: "SY-T1",
        name: "1号线",
        color: "#39B54A",
        svg: "icon@01.svg",
        svgclr: "#39B54A",
        svgtext: "#ffffff",
        overlayStyle: { color: "white", width: 1.6, opacity: 1, dashArray: "0, 0" },
        company: "三亚轨道交通",
        stationIds: ["SY01", "SY02", "SY03", "SY04", "SY05", "SY06", "SY07", "SY08", "SY09", "SY10", "SY11", "SY12", "SY13", "SY14", "SY15"],
        distances: [],
        pathPoints: [{x:724.2,y:238.0}, {x:666.7,y:238.0}, {x:663.6,y:238.3}, {x:660.8,y:239.2}, {x:658.2,y:240.6}, {x:655.9,y:242.5}, {x:654.0,y:244.8}, {x:652.6,y:247.4}, {x:651.7,y:250.2}, {x:651.4,y:253.3}, {x:651.4,y:377.2}, {x:651.5,y:380.3}, {x:652.0,y:383.3}, {x:652.7,y:386.2}, {x:653.7,y:389.0}, {x:655.0,y:391.7}, {x:656.5,y:394.3}, {x:658.3,y:396.7}, {x:660.4,y:398.9}, {x:725.8,y:464.3}, {x:727.7,y:466.7}, {x:729.1,y:469.4}, {x:730.0,y:472.2}, {x:730.3,y:475.2}, {x:730.0,y:478.1}, {x:729.1,y:480.9}, {x:727.7,y:483.6}, {x:725.8,y:486.0}, {x:637.8,y:573.9}, {x:635.8,y:576.2}, {x:634.0,y:578.6}, {x:632.5,y:581.2}, {x:631.2,y:583.9}, {x:630.2,y:586.7}, {x:629.5,y:589.6}, {x:629.0,y:592.6}, {x:628.9,y:595.6}, {x:628.9,y:908.8}]
    },
    {
        id: "SY-SL",
        name: "三乐旅游铁路",
        color: "#29ABE2",
        svg: "icon@56.svg",
        svgclr: "#29ABE2",
        svgtext: "#ffffff",
        company: "中国铁路广州局",
        overlayStyle: { color: "white", width: 3.4, opacity: 0.5, dashArray: "16, 16" },
        stationIds: ["SL01", "SL02", "SL03", "SL04", "SL05", "SL06", "SL07", "SL08"],
        distances: [],
        pathPoints: [{x:723.5,y:224.0}, {x:386.7,y:224.0}, {x:383.7,y:223.9}, {x:380.7,y:223.4}, {x:377.8,y:222.7}, {x:375.0,y:221.7}, {x:372.2,y:220.4}, {x:369.7,y:218.9}, {x:367.3,y:217.1}, {x:365.0,y:215.0}, {x:292.1,y:142.1}, {x:289.8,y:140.1}, {x:287.4,y:138.3}, {x:284.8,y:136.7}, {x:282.1,y:135.4}, {x:279.3,y:134.4}, {x:276.4,y:133.7}, {x:273.4,y:133.3}, {x:270.4,y:133.1}, {x:40.6,y:133.1}]
    },
];
