const linesData = [
    {
        id: "HN-2A",
        name: "Tuyến 2A",
        company: "Hà Nội Metro",
        color: "#B8B803",
        svg: "./city/hanoi/assets/hn-2a.svg",
        stationIds: ["HN310", "HN202", "HN203", "HN204", "HN205", "HN206", "HN207", "HN208", "HN209", "HN210", "HN211", "HN212"],
        pathPoints: [{x: 662.8, y: 169.6, r: 0}, {x: 662.8, y: 364.9, r: 0}, {x: 662.7, y: 367.5, r: 0}, {x: 662.5, y: 370.1, r: 0}, {x: 662.0, y: 372.6, r: 0}, {x: 661.4, y: 375.0, r: 0}, {x: 660.7, y: 377.5, r: 0}, {x: 659.8, y: 379.9, r: 0}, {x: 658.7, y: 382.2, r: 0}, {x: 657.5, y: 384.5, r: 0}, {x: 656.2, y: 386.7, r: 0}, {x: 654.7, y: 388.8, r: 0}, {x: 653.0, y: 390.8, r: 0}, {x: 651.3, y: 392.6, r: 0}, {x: 330.4, y: 713.6, r: 0}],
        distances: ["??", "??", "??", "??", "??", "??", "??", "??", "??", "??", "??"]
    },
    {
        id: "HN-3",
        name: "Tuyến 3",
        company: "Hà Nội Metro",
        color: "#90403E",
        svg: "./city/hanoi/assets/hn-3.svg",
        stationIds: ["HN301", "HN302", "HN303", "HN304", "HN305", "HN306", "HN307", "HN308", "HN309", "HN310", "HN311", "HN312"],
        pathPoints: [{x: 187.4, y: 169.6, r: 0}, {x: 768.5, y: 169.6, r: 0}],
        distances: ["??", "??", "??", "??", "??", "??", "??", "??", "??", "??", "??"]
    }
];
